package com.kdniao.logisticsfront.demo.core.model.enums;

import org.apache.commons.lang.StringUtils;

/**
 * 4*** 4 开头的原因代码归属“系统校验”的分类
 * 61** 61 开头的原因代码归属“缺少必要参数”的分类
 * 8*** 8 开头的原因代码归属“功能校验”的分类
 *
 * @author wensl
 */
public enum LogisticsStatus {

    s100("100", "下单成功"),
    s0000("0000", "其它错误"),
    s4001("4001", "系统发生数据错误或运行时异常系统校验"),
    s4002("4002", "报文解析错误系统校验"),
    s6101("6101", "必填项为空缺少必要参数"),
    s6102("6102", "寄件方公司名称（j_company）为空缺少必要参数"),
    s6103("6103", "寄件方联系人（j_contact）为空缺少必要参数"),
    s6106("6106", "寄件方详细地址（j_address）为空缺少必要参数"),
    s6107("6107", "到件方公司名称（d_company）为空缺少必要参数"),
    s6108("6108", "到件方联系人（d_contact）为空缺少必要参数"),
    s6111("6111", "到件方详细地址（d_address）为空，下单失败缺少必要参数"),
    s6114("6114", "客户订单号（orderid）为空，筛单失败缺少必要参数"),
    s6117("6117", "到件方详细地址（d_address）为空，筛单失败缺少必要参数"),
    s6118("6118", "客户订单号（orderid）为空，下单失败缺少必要参数"),
    s6119("6119", "到件方联系电话（d_tel）为空缺少必要参数"),
    s6120("6120", "快件产品类别（express_type）为空缺少必要参数"),
    s6121("6121", "寄件方联系电话（j_tel）为空缺少必要参数"),
    s6122("6122", "筛单类别（filter_type）不合法缺少必要参数"),
    s6123("6123", "顺丰运单号（mailno）为空缺少必要参数"),
    s6124("6124", "付款方式（pay_method）为空缺少必要参数"),
    s6125("6125", "Order/Cargo元素必填项为空缺少必要参数"),
    s6126("6126", "顺丰月结卡号（custid）不合法缺少必要参数"),
    s6127("6127", "增值服务名（Order/AddedService元素的name）为空缺少必要参数"),
    s6128("6128", "增值服务名（Order/AddedService元素的name）不合法缺少必要参数"),
    s6129("6129", "付款方式（pay_method）不合法缺少必要参数"),
    s6130("6130", "订单货物总体积（volume）不合法缺少必要参数"),
    s6131("6131", "客户订单操作标识（dealtype）不合法缺少必要参数"),
    s6132("6132", "路由查询类别（method_type）不合法缺少必要参数"),
    s6133("6133", "查询号类别（tracking_type）不合法缺少必要参数"),
    s6134("6134", "请求XML报文不合法，筛单失败缺少必要参数"),
    s6135("6135", "请求XML报文不合法，下单失败缺少必要参数"),
    s6136("6136", "请求XML报文不合法，订单确认/取消失败缺少必要参数"),
    s6137("6137", "请求XML报文不合法，路由查询失败缺少必要参数"),
    s6138("6138", "代收货款金额（Order/AddedService元素的value）不合法缺少必要参数"),
    s6139("6139", "代收货款金额（Order/AddedService元素的value）不合法，不能小于0缺少必要参数"),
    s6140("6140", "代收货款卡号（Order/AddedService元素的value1）为空缺少必要参数"),
    s6141("6141", "代收货款卡号（Order/AddedService元素的value1）不合法，未配置代收货款上限缺少必要参数"),
    s6142("6142", "代收货款金额（Order/AddedService元素的value）不合法，超过代收货款上限缺少必要参数"),
    s6150("6150", "客户订单号（orderid）不存在缺少必要参数"),
    s8000("8000", "报文参数不合法功能校验"),
    s8001("8001", "IP未授权"),
    s8002("8002", "未授权使用此接口功能校验"),
    s8003("8003", "批量交易超上限（OrderFilter元素）功能校验"),
    s8004("8004", "批量交易超上限（查询号tracking_number）功能校验"),
    s8005("8005", "接口调用次数超上限功能校验"),
    s8009("8009", "客户订单不可以收派，确认订单失败功能校验"),
    s8010("8010", "客户订单未筛单，确认订单失败功能校验"),
    s8011("8011", "接入编码与顺丰运单号（mailno）不匹配功能校验"),
    s8012("8012", "接入编码与客户订单号（orderid）不匹配功能校验"),
    s8013("8013", "查询号（tracking_number）为空，路由查询失败功能校验"),
    s8014("8014", "校验码错误功能校验"),
    s8015("8015", "顺丰母运单号（main_mailno）为空，子单号申请失败功能校验"),
    s8016("8016", "客户运单号（orderid）已存在功能校验"),
    s8017("8017", "客户订单号（orderid）与顺丰运单号（mailno）不匹配功能校验"),
    s8018("8018", "未获取到客户订单信息功能校验"),
    s8019("8019", "客户订单号（orderid）已确认功能校验"),
    s8020("8020", "不存在该客户订单号（orderid）跟顺丰运单号（mailno）的绑定关系功能校验"),
    s8021("8021", "接入编码为空功能校验"),
    s8023("8023", "服务名称为空功能校验"),
    s8024("8024", "此客户订单号不存在对应的顺丰运单号，确认/取消失败功能校验"),
    s8025("8025", "未传入服务名称或服务名称不合法功能校验"),
    s8026("8026", "接入编码不存在功能校验"),
    s8027("8027", "业务模板不存在功能校验"),
    s8028("8028", "业务模板配置/属性未设置功能校验"),
    s8029("8029", "默认业务模板未配置功能校验"),
    s8030("8030", "业务模板不在生效日期范围内功能校验"),
    s8031("8031", "数据错误，未找到业务模板功能校验"),
    s8032("8032", "数据错误，未找到业务模板配置功能校验"),
    s8033("8033", "数据错误，未找到业务模板属性功能校验"),
    s8034("8034", "人工筛单结果推送已注册功能校验"),
    s8035("8035", "顺丰运单号为空，客户订单自动确认失败功能校验"),
    s8036("8036", "顺丰运单号为空，路由推送注册失败功能校验"),
    s8037("8037", "客户订单号已取消功能校验"),
    s8039("8039", "业务类型（business_type）不合法，时效查询失败功能校验"),
    s8040("8040", "原寄地区域代码（code）无法获取，时效查询失败功能校验"),
    s8041("8041", "目的地区域代码（code）无法获取，时效查询失败功能校验"),
    s8042("8042", "寄件时间（consigned_time）不合法功能校验"),
    s8066("8066", "新增加的包裹数（parcel_quantity）不合法，子单号申请失败功能校验"),
    s8067("8067", "新增加的包裹数（parcel_quantity）超上限，子单号申请失败功能校验"),
    s8068("8068", "顺丰运单号已经生成清单，子单号申请失败功能校验"),
    s8069("8069", "客户订单不可以收派，子单号申请失败功能校验"),
    s8096("8096", "您的预约超出今日营业时间，无法上门取件。"),
    s8119("8119", "月结卡号不存在或已失效。"),
    s9999("9999", "不可派送");

    private String code;
    private String desc;

    private LogisticsStatus(String code, String desc) {
        this.code = code;
        this.desc = desc;
    }

    public String getCode() {
        return code;
    }

    public String getDesc() {
        return desc;
    }

    public static LogisticsStatus fromCode(String code) {
        for (LogisticsStatus status : values()) {
            if (StringUtils.equals(status.getCode(), code)) {
                return status;
            }
        }
        return null;
    }
}
